<script>
export default {
    name: "Help"
}
</script>

<template>

    <div class="verticalSet--s sideMargin info">
        <h2>Правила игры</h2>
        <ol>
            <li>Загаданное слово состоит из 5 букв.</li>
            <li>У вас есть 6 попыток, чтобы отгадать его.</li>
            <li>
                После каждой попытки буквы подсвечиваются:
                <ul>
                    <li>🟩 Зелёный — буква стоит на правильном месте.</li>
                    <li>🟨 Жёлтый — буква есть в слове, но в другом месте.</li>
                    <li>⬜️ Серый — буквы нет в слове.</li>
                </ul>
            </li>
            <li>Используйте подсказки цветов, чтобы угадать слово за меньшее число ходов.</li>
        </ol>

        <h2>Решатель</h2>
        <p>
            Позволяет подобрать загаданное слово на основе подсказок, которые даёт игра. Чтобы изменить цвет буквы
            нажмите на неё, или используйте пробел при вводе слова. После ввода слов и указания цветов букв, под
            словами появляются результаты расчёта.
        </p>

        <h2>Исходный код</h2>
        <p><a class="link link--href" href="https://github.com/alexbobrow/five-js/">github.com/alexbobrow/five-js/</a></p>

    </div>
</template>

<style scoped>

</style>